cylinder_conv/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    // immersedBoundary 1;
    // polyMesh 2;
    // fvMesh   2;
}

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
(
    forces
    {
        type               forces;
        functionObjectLibs ("libforces.so");

        outputControl timeStep;
        outputInterval 1;
        patches ( cylinder_region0 );

        pName       p;
        UName       U;
        rhoName     rhoInf;
        rhoInf      1;

        log         true;
        CofR        ( 0 0 0 );

        Aref 0.002;
        Uref 0.01;
    }
);

// ************************************************************************* //
